Repository: ahmed3777/Road-Share
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Skip
ar: تخطي

source: NEXT
ar: التالي

source: Done
ar: تم

source: Save
ar: حفظ

source: Cancel
ar: الغاء

source: Get Started!
ar: ابدأ ألان!

# onboardingtitle1
source: Request Ride
ar: طلب رحلة

# onboardingtitle2
source: Confirm Your Driver
ar: استلام الرحلة

# onboardingtitle3
source: Track your ride
ar: تقييم السائق

# onboardingsubtitle1
source: Request a ride get picked up by a nearby community driver
ar: طلب رحلة واستلامها من سائق مجاور

# onboardingsubtitle2
source: Huge drivers network helps you find comforable, safe and cheap ride
ar: شبكة السائقين كبيرة تساعدك في الحصول على رحلة مريحة وسلامة ومناسبة

# onboardingsubtitle3
source: Know your driver in advance and be able to view current location in real time on the map
ar: تعرف على سائقك في المساء وكيفية عرض موقعك في الوقت الحالي على الخريطة

source: Log in
ar: تسجيل الدخول

source: Log into your account
ar: تسجيل الدخول في حسابك

# Welcome_to_Roadshare
source: Welcome to Roadshare, enter your details below to continue ordering
ar: مرحبا بك في Roadshare, ادخل التفاصيل التالية للمتابعة

# Enter_Phone
source: Enter your Phone
ar: ادخل رقم الهاتف

source: Continue
ar: استمر

# DontHaveAnAccount
source: Donâ€™t have an account?
ar: ليس لديك حساب؟

source: or
ar: او

source: Sign up
ar: انشاء حساب

source: Create your account
ar: انشاء حساب جديد

source: Continue with Google
ar: استمر بواسطة جوجل

source: Continue with Apple
ar: استمر بواسطة ابل

source: SMS Code
ar: رمز SMS

source: Enter your name
ar: ادخل اسمك

source: Enter your email
ar: ادخل بريدك الالكتروني

source: Enter your Phone
ar: ادخل رقم الهاتف

# isAvailable
source: Available
ar: متوفر

source: Rider
ar: راكب

source: Driver
ar: سائق

source: Select Role
ar: اختر نوعك

source: Name required
ar: اسم مطلوب

source: Email required
ar: البريد الالكتروني مطلوب

source: Phone required
ar: رقم الهاتف مطلوب

source: Role required
ar: نوع مطلوب

source: Name must be at least 3 characters
ar: اسم يجب ان يكون اكثر من 3 حروف

source: Email must be valid
ar: البريد الالكتروني يجب ان يكون صالح

source: Phone must be valid
ar: رقم الهاتف يجب ان يكون صالح

source: Name must contain only letters and spaces
ar: اسم يجب ان يحتوي على حروف فقط ومسافات فقط

source: Email must contain only letters and spaces
ar: البريد الالكتروني يجب ان يحتوي على حروف فقط ومسافات فقط

source: Email must be at least 6 characters
ar: البريد الالكتروني يجب ان يكون اكثر من 6 حروف

source: Phone must be at least 11 characters
ar: رقم الهاتف يجب ان يكون اكثر من 11 حرف
